[
  {
  "title": "Agile Project Manager ",
  "employment": "Full-time/W2, Contract, no subcontracting",
  "seniority": "Senior",
  "link": "AgilePM071919",
  "functions": "Information Technology",
  "education": "Bachelor’s (BA/BS) degree in Business, Management Information Systems, Computer Science, or a related field is required or the equivalent of 8 years of Project Management experience.",
  "scope": "The Project Manager will work directly with an internal team as well as (at times) vendors and third-party partners to develop joint project plans for our integration projects. Other duties of the Project Manager include planning and submitting recommendations to resolve discrepancies, taking action on issues of non-compliance, keeping lines of communication open among all project stakeholders, tracking deliverables, milestones and any decisions made regarding the request for changes and outstanding items.",
  "description": "Orange Bees is a leader in the upstate region of South Carolina for its world-class software development. Established in 2013, Orange Bees, aim to improve the manufacturing, insurance, financial, association, and retail industries; where we have an extensive track record of success in Product Engineering, Enterprise Management, System Integration, Mobile Application Development, Web Application Development, and Data Analytics.\n\nOur client, an innovative automotive manufacturing company, is looking for a talented individual for an opportunity in the Greenville/Spartanburg Area of South Carolina. This position is a long-term contract position with the possibility of multi-year extension and conversion to a full-time/permanent position.\n",
  "responsibilities": [
    "Develop global standards for project management; project templates, status reporting, and governance.",
    "Facilitate periodic stage gate reviews. Participate in a project governance team.",
    "Responsible for key deliverables such as timely communication of project milestones, status reporting, change requests, and budget performance.",
    "Responsible for meetings and planning sessions at various stages of the project lifecycle, as required.",
    "Promote project management best practices; train IT and other functional groups on PM methodologies.",
    "Work closely with business leaders and remain actively involved in sponsor/stakeholder management.",
    "Establish and implement project management best practices.",
    "Work with teams in resolving discrepancies, removing or mitigating roadblocks, acting on issues of non-compliance, and facilitating communication among all project stakeholders.",
    "Ensure effective tracking of outstanding deliverables, milestones, and change requests. Provide regular status updates to project stakeholders."
  ],
  "experience": [
    "Must have Agile project management experience, Scale Agile Methodology experience a big plus",
    "Experience with Atlassian Toolset is a big plus",
    "Any PM or Scrum Master certifications are a plus",
    "Project Management Professional (PMP) Designation is preferred.",
    "Plus 4 years of hands-on experience in project management, including expertise with project management tools. "
  ],
  "knowledge": [
    "Strong organization and time management skills.",
    "Highly developed and influential communication, facilitation and presentation skills.",
    "Team player with proven ability to facilitate project delivery through high-functioning teams.",
    "Ability to scope and size work efforts effectively.",
    "Ability to lead ad hoc teams of bright and highly motivated individuals."
  ]
},
  {
  "title": "JAVA Developer ",
  "employment": "Full-time/W2, contract, no subcontracting",
  "seniority": "Mid to Junior Level ",
  "link": "MidJavaDev071919",
  "functions": "Information Technology",
  "education": "BA/BS in Information Technology or Computer Science plus TWO years of working experience in IT Application Development or the equivalent of 6 years professional experience in IT Applications development and support",
  "scope": "We are looking for a Java Developer with a high level of MVC Development experience and Spring experience is a plus. The person in this role must be system oriented with a strong ability to estimate and execute software tasks from inception to deployment. They must have Java REST endpoint development skills and must know some Java Script. ",
  "description": "Orange Bees is a leader in the upstate region of South Carolina for its world-class software development. Established in 2013, Orange Bees, aim to improve the manufacturing, insurance, financial, association, and retail industries; where we have an extensive track record of success in Product Engineering, Enterprise Management, System Integration, Mobile Application Development, Web Application Development, and Data Analytics.",
  "responsibilities": [
    "Serves as a primary point of contact for other engineers and specialists in the team to provide expert knowledge and troubleshooting skills.",
    "Works on several development initiatives concurrently and provide subject matter expertise on customer implementations and product customization.",
    "Partners with other developers to develop functionality following existing style and coding standards.",
    "Reviews designs, demo prototypes and provides application support.",
    "Defines the visualization and realization of future technologies.",
    "Serves as an internal consultant to other developers and engineers as needed, providing assistance in all phases of product life-cycle development.",
    "Maintains accurate, meaningful and updated technical and non-technical documentation pertaining to all aspects of area(s) of responsibility.",
    "Analyzes business critical processes, evaluates and recommends improvements.",
    "Work closely with the architecture team for the design and review of development projects to ensure the work is in line with the overall design and strategy ",
    "Participate in an Agile team and be actively involved in the full software development life cycle",
    "Develop new and improve existing processes ",
    "Create and perform unit tests and test automation"
  ],
  "experience": [
    "Experience working in an Agile environment",
    "Minimum 2 years’ experience working in a team-oriented, collaborative environment.",
    "2+ years of technical experience in Information Technology. ",
    "1+ years of experience in web with demonstrated strengths in software development, integration, and testing",
    "2+ years of experience developing enterprise or client facing web applications.",
    "2+ years of experience interfacing with REST endpoint development",
    "2+ years of experience with Object oriented programming (Javascript).",
    "Process/project management experience or training/certifications (preferred)."
  ],
  "knowledge": [
    "Core Java Knowledge",
    "Java MVC Development (spring is a plus)",
    "Frameworks",
    "Must have Java REST endpoint development experience",
    "Must know some JavaScript",
    "Agile experience is a plus",
    "Value experience more than formal education for this one",
    "Strong SQL skills"
  ]
},
  {
  "title": "Senior Full-Stack Web Developer",
  "employment": "Full-time/ W2",
  "seniority": "Senior",
  "link": "Fullstack071919",
  "functions": "Information Technology",
  "education": "BA/BS in Information Technology or Computer Science or the equivalent of 4 years professional experience in IT Applications development and support",
  "scope": "We are looking for a full-stack developer with a high level of node.js and Angular 2+ experience. The person in this role must be system oriented with a strong ability to estimate and execute software tasks from inception to deployment. They must also be a strong programmer with more than 6 years of experience in writing code. Designs and develops overall architecture for web application using leading edge technologies and know-how from Industry, partner companies, local universities and internal partners into automotive concepts.",
  "description": "Orange Bees is a leader in the upstate region of South Carolina for its world-class software development. Established in 2013, Orange Bees, aim to improve the manufacturing, insurance, financial, association, and retail industries; where we have an extensive track record of success in Product Engineering, Enterprise Management, System Integration, Mobile Application Development, Web Application Development, and Data Analytics.",
  "responsibilities": [
    "Design, develop, and implement JavaScript solutions leveraging Node.js for web applications.",
    "Defines and documents the design of functionality through use cases, business process flows, UI design, and UML modeling as necessary.",
    "Serves as a primary point of contact for other engineers and specialists in the team to provide expert knowledge and troubleshooting skills.",
    "Works on several development initiatives concurrently and provide subject matter expertise on customer implementations and product customization.",
    "Partners with other developers to develop functionality following existing style and coding standards.",
    "Reviews designs, demo prototypes and provides application support.",
    "Defines the visualization and realization of future technologies.",
    "Serves as an internal consultant to other developers and engineers as needed, providing assistance in all phases of product life-cycle development.",
    "Maintains accurate, meaningful and updated technical and non-technical documentation pertaining to all aspects of area(s) of responsibility.",
    "Analyzes business critical processes, evaluates and recommends improvements.",
    "Work closely with the architecture team for the design and review of development projects to ensure the work is in line with the overall design and strategy ",
    "Participate in an Agile team and be actively involved in the full software development life cycle ",
    "Develop new and improve existing processes ",
    "Create and perform unit tests and test automation"
  ],
  "experience": [
    "Node.js experience is the key to this one, need high level of node experience",
    "Angular 2+ experience. Need basic knowledge and willingness to learn more advanced angular skills",
    "Value experience more than formal education",
    "Experience developing RESTful APIs",
    "Experience working in an Agile environment",
    "2+ years of technical experience in Information Technology. ",
    "2+ years of experience in web with demonstrated strengths in software development, integration, and testing",
    "1+ years of experience deploying and supporting Web applications.",
    "1+ years of experience interfacing with REST Web Services and JSON/XML",
    "1+ years of experience monitoring and supporting performance of web applications and infrastructure."
  ],
  "knowledge": [
    "Knowledge of object oriented programming (Objective C, C++, Javascript).",
    "Basic knowledge of Linux Server administration, Version Control Systems.",
    "Process/project management experience or training/certifications (preferred)."
  ]
},
{
  "title": "Senior Java Engineer ",
  "employment": "Full-time/W2",
  "seniority": "Senior",
  "link": "JavaEngineer071919",
  "functions": "Information Technology",
  "education": "BA/BS in Information Technology or Computer Science plus 6 years of working experience in IT Application Development or the equivalent of 10 years professional experience in IT Applications development and support",
  "scope": "We are looking for a Senior Java Enigneer with a high level of knowledge in writing Java REST API’s, Apache Camel, Large-Scale enterprise application experience, any front-end JavaScript experience and GraphQL experience or willingness to learn. The person in this role must be system oriented with a strong ability to estimate and execute software tasks from inception to deployment. They must have Java REST API development skills and must know some Java Script. ",
  "description": "Orange Bees is a leader in the upstate region of South Carolina for its world-class software development. Established in 2013, Orange Bees, aim to improve the manufacturing, insurance, financial, association, and retail industries; where we have an extensive track record of success in Product Engineering, Enterprise Management, System Integration, Mobile Application Development, Web Application Development, and Data Analytics.",
  "responsibilities": [
    "Serves as a primary point of contact for other engineers and specialists in the team to provide expert knowledge and troubleshooting skills.",
    "Works on several development initiatives concurrently and provide subject matter expertise on customer implementations and product customization.",
    "Partners with other developers to develop functionality following existing style and coding standards.",
    "Reviews designs, demo prototypes and provides application support.",
    "Defines the visualization and realization of future technologies.",
    "Serves as an internal consultant to other developers and engineers as needed, providing assistance in all phases of product life-cycle development.",
    "Maintains accurate, meaningful and updated technical and non-technical documentation pertaining to all aspects of area(s) of responsibility.",
    "Analyzes business critical processes, evaluates and recommends improvements.",
    "Work closely with the architecture team for the design and review of development projects to ensure the work is in line with the overall design and strategy ",
    "Participate in an Agile team and be actively involved in the full software development life cycle ",
    "Develop new and improve existing processes ",
    "Create and perform unit tests and test automation"
  ],
  "experience": [
    "Experience working in an Agile environment",
    "Minimum 5 years’ experience working in a team-oriented, collaborative environment.",
    "5+ years of technical experience in Information Technology. ",
    "5+ years of experience in web with demonstrated strengths in software development, integration, and testing",
    "5+ years of experience interfacing with REST API development",
    "Any experience with Object oriented programming (Javascript).",
    "Experience working with Large-Scale enterprise application",
    "Experience with Apache Camel (Required)",
    "GraphQUL Experience or willingness to learn quickly",
    "Process/project management experience or training/certifications (preferred, but not required)."
  ],
  "knowledge": [
    "Must know how to write Java REST API’s",
    "Large-scale enterprise application experience",
    "Any front-end JavaScript experience is a big plus"
  ]
},
  {
  "title": "Software QA Test Engineer ",
  "employment": "Full-time, W2, contract renewable, no subcontracting",
  "seniority": "Junior to Mid Level ",
  "link": "softwareQA080619",
  "functions": "Software Testing, QA Testing, Test Engineer",
  "education": "Bachelor’s Degree (Computer Science or Information Systems preferred) or the equivalent of 4 years of related experience in Information Technology.",
  "scope": "Responsible for the full development life cycle and resulting quality of the projects/programs within area of responsibility. Designs, Develops and implements all test plans and test cases through the use of test automation and requirements and data analysis. Ensures testing coverage of software developed by the team as an integral part of the Continuous Delivery process.",
  "description": "Orange Bees is a leader in the upstate region of South Carolina for its world-class software development. Established in 2013, Orange Bees, aim to improve the manufacturing, insurance, financial, association, and retail industries; where we have an extensive track record of success in Product Engineering, Enterprise Management, System Integration, Mobile Application Development, Web Application Development, and Data Analytics.\n\nOur client, an innovative automotive manufacturing company, is looking for a talented individual for an opportunity in the Greenville/Spartanburg Area of South Carolina. This position is a long-term contract position with the possibility of multi-year extension and conversion to a full-time/permanent position.\n",
  "responsibilities": [
    "Performs planning, analysis, designing, requirements definition, functional design, development, testing and implementation of IT solutions",
    "Collaborates with both internal and external partners to build test strategies, plan testing activities and implement best practices for test data management.",
    "Engineers automated tests and integrate them into the team’s continuous delivery pipeline.",
    "Creates and perform manual tests, if necessary, as a fallback scenario",
    "Contributes to problem solving and root cause analysis when defects occur.",
    "Reviews and analyzes the effectiveness and efficiency of existing systems and develop strategies for improving or further leveraging these systems",
    "Contributes meaningfully to the refinement of user stories to support acceptance test driven development.",
    "Promotes test centric software development by educating and influencing teammates on the appropriate application of different testing methodologies, frameworks, and tools.",
    "Ensures test coverage and regression testing of software releases.",
    "Participates in agile ceremonies, communities of practice and continuous improvement efforts."
  ],
  "experience": [
    "5+ years of experience performing IT system analysis and integration.",
    "3+ years of experience working with software QA processes and best practices.",
    "3+ years of experience utilizing test automation processes and tools including Selenium, Postman, Jira, Xray and Java/JS/Python (preferred).",
    "3+ years of knowledge of testing concepts and methodologies, including unit testing, integration testing, API testing, user acceptance testing, regression, test automation, TDD, BDD, ATDD, test data management, Cucumber frameworks and Gherkin language and continuous delivery.",
    "3+ years of experience demonstrating communication and organizational skills to work with successfully with developers, product owners and other stakeholders.",
    "1+ years of experience working with IT security and risk assessment.",
    "1+ years of experience working with application development technologies (Apache, J2EE, modern application development frameworks).",
    "5+ years of experience with software development using a variety of languages including C# and .NET",
    "1+ years of experience leading small technical teams/projects (preferred).",
    "3+ years of experience working as part of a team using Agile methodology and Continuous Delivery practices."
  ],
  "knowledge": [
    "Basic understanding of Authentication systems (Windows AD, LDAP, SSO Solutions, MFA)."
  ]
},
  {
  "title": "JavaScript Developer ",
  "employment": "Full-time, W2",
  "seniority": "Junior Level",
  "link": "javascript080719",
  "functions": "Information Technology, Software Development, Javascript, Vue.js, Git",
  "education": "Bachelors degree in computer science, engineer, IT or related field. ",
  "scope": "This role will involve managing a range of online projects to be on time, on budget and within the project scope. Must be adaptable and willing to learn. The following technologies are key to your successful application:",
  "description": "Orange Bees is a leader in the upstate region of South Carolina for its world-class software development. Established in 2013, Orange Bees, aim to improve the manufacturing, insurance, financial, association, and retail industries; where we have an extensive track record of success in Product Engineering, Enterprise Management, System Integration, Mobile Application Development, Web Application Development, and Data Analytics.",
  "responsibilities": [
    "Serves as a primary point of contact for other engineers and specialists in the team to provide expert knowledge and troubleshooting skills.",
    "Works on several development initiatives concurrently and provide subject matter expertise on customer implementations and product customization.",
    "Partners with other developers to develop functionality following existing style and coding standards.",
    "Reviews designs, demo prototypes and provides application support.",
    "Serves as an internal consultant to other developers and engineers as needed, providing assistance in all phases of product life-cycle development.",
    "Maintains accurate, meaningful and updated technical and non-technical documentation pertaining to all aspects of area(s) of responsibility.",
    "Analyzes business critical processes, evaluates and recommends improvements.",
    "Participate in an Agile team and be actively involved in the full software development life cycle  Develop new and improve existing processes ",
    "Create and perform unit tests and test automation"
  ],
  "experience": [
    "1.5-2 years of experience with Enterprise applications",
    "2+ years of experience with JavaScript",
    "Must have experience with VUE.js",
    "Nice to have experience with Git",
    "Nice to have experience with NPM, HTTP, CSS, SASS or similar extension language"
  ],
  "knowledge": [
    "Experience with Material Design libraries (i.e. Vuetify, Material for Angular)",
    "Backend experience with DB",
    "Java",
    "Docker/ Docker Swarm",
    "Kubernetes",
    "ELK Stack",
    "jenkins",
    "CI/CD Pipeline",
    "GraphQL",
    "Swagger Docs",
    "Azure, BitBucket, Rally, Agile programming"
  ]
},
  {
  "title": "Node Developer ",
  "employment": "Full-time/W2",
  "seniority": "Junior to Mid Level",
  "link": "node080719",
  "functions": "Information Technology, Software Development, Node.js, Nestjs, Angular 7",
  "education": "Bachelors degree in computer science, engineer, IT or related field. ",
  "scope": "This role will involve managing a range of online projects to be on time, on budget and within the project scope. Must be willing to learn and adapt at fast pace. The following technologies are key to your successful application:",
  "description": "Orange Bees is a leader in the upstate region of South Carolina for its world-class software development. Established in 2013, Orange Bees, aim to improve the manufacturing, insurance, financial, association, and retail industries; where we have an extensive track record of success in Product Engineering, Enterprise Management, System Integration, Mobile Application Development, Web Application Development, and Data Analytics.",
  "responsibilities": [
    "Designs and develops web applications.",
    "Works on several development initiatives concurrently and provide subject matter expertise on customer implementations and product customization.",
    "Partners with other developers to develop functionality following existing style and coding standards.",
    "Reviews designs, demo prototypes and provides application support.",
    "Defines the visualization and realization of future technologies.",
    "Serves as a primary point of contact for other engineers and specialists in the team to provide expert knowledge and troubleshooting skills.",
    "Maintains accurate, meaningful and updated technical and non-technical documentation pertaining to all aspects of area(s) of responsibility.",
    "Analyzes business critical processes, evaluates and recommends improvements.",
    "Serves as an internal consultant to other developers and engineers as needed, providing assistance in all phases of product life-cycle development."
  ],
  "experience": [
    "Minimum of 2 years enterprise experience ",
    "2+ years experience with Node.js experience using Express",
    "Some exprience with Nest.js on some level and willing to learn more",
    "2+ years of experience Javascript, typescript, Angular7 or 8 "
  ],
  "knowledge": [
    "Docker/ Docker Swarm",
    "Kubernetes",
    "Git",
    "Knowledge of AWS"
  ]
},
  {
  "title": "Business Analyst I",
  "employment": "Full-time/W2, contract renewable, no subcontracting",
  "seniority": "Mid to Senior Level",
  "link": "BA080719",
  "functions": "Information Technology, Business Analysis, IT Project Management",
  "education": "BA or BS degree in Computer Science, Information Technology, Science, Business or equivalent with 3 to 5 years experience in IT Application or Infrastructure Profession.",
  "scope": "Oversees the responsibility for business process analysis, cost/benefit analysis, design and simulation for smallmedium sized projects. Requires highest level understanding of organization's business processes and requirements.",
  "description": "Orange Bees is a leader in the upstate region of South Carolina for its world-class software development. Established in 2013, Orange Bees, aim to improve the manufacturing, insurance, financial, association, and retail industries; where we have an extensive track record of success in Product Engineering, Enterprise Management, System Integration, Mobile Application Development, Web Application Development, and Data Analytics.\n\nOur client, an innovative automotive manufacturing company, is looking for a talented individual for an opportunity in the Greenville/Spartanburg Area of South Carolina. This position is a long-term contract position with the possibility of multi-year extension and conversion to a full-time/permanent position.\n",
  "responsibilities": [
    "Partners with business units to analyze current operational procedures, identify problems, and learn specific input and output requirements such as forms of data input, how data is to be processed, and how the results will be managed.",
    "Expert in current “as-is” process and works with the business to define the “to-be” process",
    "Partners with the global network to ensure synergies with existing systems and alignment with group strategy.",
    "Reviews and analyzes system capabilities, workflow, and scheduling limitations to determine if requested program or program change is possible within existing system - identifies and differentiates system configuration from programming solutions.",
    "Prepares time and cost estimates for completing projects.",
    "Writes detailed functional specifications for program development.",
    "Performs and documents system configuration.",
    "Coordinates system interface design and development.",
    "Provides on-call support as needed.",
    "Prepares/coordinates technical reports, process documentation, test plans, training needs assessment, and implementation plans.",
    "Supports Department Manager, Process IT with the management of specific elements of projects to schedule following systems development methodology; accountable for efficient and maintainable results that meet business requirements.",
    "Researches, coordinates feasibility studies and makes recommendations on process changes and automation in support of improving business processes and cost savings.",
    "Ensures target achievement is consistently attained.",
    "Creates process change by integrating new processes with existing ones.",
    "Recommends and facilitates quality improvement efforts. Stays up to date on future innovations, technical trends and applies this to direct future changes. Has knowledge of the solutions available as well as best practices for the business processes.",
    "Serves as an IT project manager for small-medium sized projects overseeing resources assigned, conduct status meetings, and effectively communicates the project status to stakeholders as delegated by the Department Manager, Process IT.",
    "Develops project plans, administers the change control process and ensures that tasks are completed on time and within budget",
    "Works closely with the business to understand the business requirements to determine the correct system design.",
    "Prepares business process mapping and function design.",
    "Prepares identification of gaps in the business process.",
    "Analyzes business partner’s operations to understand their strengths and weaknesses to determine opportunities to automate processes and functions.",
    "Assists and recommends business process redesign and documentation as needed.",
    "Translates high level business requirements into functional specifications for IT development."
  ],
  "experience": [
    "3 to 5 years of project leadership or system responsibility experience in an IT environment",
    "3 to 5 years of experience as Systems Analysis",
    "3 to 5 years experience working in a team-oriented, collaborative environme",
    "5+ years experience in planning, analysis and design of IT solutions",
    "5+ years experience with IT governance and system development life cycle",
    "5+ years business experience preferably in the area of assigned responsibility"
  ],
  "knowledge": [
    "5+ years of Knowledge of project management",
    "Basic knowledge of database, operating systems and IT relevant infrastructure environment"
  ]
}
]
