[
  {
    "title": "Junior/Mid/Senior Web Developer",
    "employment": "Full-time/W2",
    "seniority": "Junior/Mid/Senior",
    "link": "NET_SR090919",
    "functions": "Information Technology",
    "education": "Bachelors in Computer Science/Computer Engineering/CIS/ or Code Camp certification. Depending on experience, education is not required.",
    "scope": "This role will involve developing a range of projects to be on time, on budget and within the project scope. This position is specifically looking for a developer with proficiency in either Angular, VueJs, or React (with a higher priority in Angular and VueJs). This position is on-site only, no remote work. Candidate must be able to work independently or within a team. Position requires to be onsite with occasional travel to client sites. Contact switching is a highly desirable skillset.",
    "description": "Orange Bees is a leader in the upstate region of South Carolina for its world-class software development. Established in 2013, Orange Bees, aim to improve the manufacturing, insurance, financial, association, and retail industries; where we have an extensive track record of success in Product Engineering, Enterprise Management, System Integration, Mobile Application Development, Web Application Development, and Data Analytics.",
    "responsibilities": [
      "Write frontend code in a clean and efficient manner",
      "Communicate with other teammates respectably and be able to work on projects with a few developers",
      "Visit client sites on occasion and represent the company in meetings"
    ],
    "experience": [
      "1.5-2 years of experience with Enterprise applications",
      "JavaScript",
      "Angular, VueJs, or React",
      "Experience working in an Agile environment (preferred)",
      "Git and Git branching",
      "NodeJs (preferred)",
      "TypeScript (preferred)"
    ],
    "knowledge": [
      "Understanding of Software Development Life Cycle and Agile methodologies.",
      "Profiency in latest JavaScript features",
      "Profiency in one of the above listed JavaScript frameworks",
      "Profiency in CSS/SCSS"
    ]
  }
]
